# tap repositories and their packages
tap "hashicorp/tap"

# CLI Applications
brew "git"
brew "asdf"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "awscli"
brew "cmake"
brew "coreutils"
brew "zstd"
brew "curl"
brew "docker"
brew "gh"
brew "git-lfs"
brew "make"
brew "mas"
brew "sl"
brew "tcl-tk"
brew "tree"
brew "vim"
brew "webp"
brew "wget"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"

# Desktop Applications
cask "cyberduck"
cask "discord"
cask "docker-desktop"
cask "drawio"
cask "github"
cask "google-chrome"
cask "handbrake-app"
cask "iterm2"
cask "microsoft-office"
cask "obs"
cask "ollama-app"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "steam"
cask "the-unarchiver"
cask "visual-studio-code"
cask "webpquicklook"
cask "zoom"

# VSCode Extensions
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "christian-kohler.path-intellisense"
vscode "continue.continue"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "ibm.output-colorizer"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "mtxr.sqltools"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
